# 基本配置

基本配置

2011年6月27日

17:15

**1.激活IPv6功能**

默认情况下，Cisco设备的IPv6流量转发功能是关闭的，需要使用IPv6，必须先开启IPv6流量转发功能。

**（1）开启IPv6流量转发功能**

r1(config)#ipv6 unicast-routing

**2.配置正常的IPv6地址**

**（1）在接口下配置正常IPv6地址**

r1(config)#int f0/0

r1(config-if)#ipv6 address 2011:1:2:3:1:1:1:1/64

**说明：**配置的地址前64位为网络地址，即2011:1:2:3；后64位为主机位，即1:1:1:1。

**（2）查看接口的IPv6地址**

r1#show ipv6 interface brief f0/0

FastEthernet0/0            [up/up]

FE80::C200:EFF:FEB0:0

2011:1:2:3:1:1:1:1

r1# r1#

**说明：**可以看到接口F0/0已经接受我们配置的地址2011:1:2:3:1:1:1:1。

**3.使用EUI-64格式配置静态地址：**

**(1)配置包含EUI-64的IPv6地址**

r1(config)#int f0/1

r1(config-if)#ipv6 address 2022:2:2:22::/64 eui-64

**（2）查看接口的IPv6地址**

r1#show interfaces f0/0

FastEthernet0/0 is up, line protocol is up

Hardware is Gt96k FE, address is c000.0eb0.0000 (bia c000.0eb0.0000)

r1#show ipv6 interface brief f0/1

FastEthernet0/1            [up/up]

FE80::C200:EFF:FEB0:1

2022:2:2:22:C200:EFF:FEB0:1

r1#

**说明：**可以看到，F0/1成功使用接口上的MAC地址为EUI-64来填充后64位。

**4.仅启用接口IPv6功能**

**说明：**一个接口上可以仅启用IPv6功能，而不配置IPv6地址

**（1）启用接口IPv6功能**

r1(config)#int s1/0

r1(config-if)#ipv6 enable

**（2）查看接口IPv6状态**

r1#show ipv6 interface brief serial 1/0

Serial1/0                  [up/up]

FE80::C200:EFF:FEB0:0

r1#

可以看到，接口S1/0可以只开启IPv6功能而不配地址，但开了IPv6功能的接口也会**自动产生一个链路本地地址。**

**5.配置无编号地址**

当地址紧缺时，可以配置一个接口使用另外一个接口的地址，这样的地址称为无编号地址，即unnumbered地址，当从无编号接口产生数据包时，该接口使用借用的那个接口的地址作为源地址，配置这样的地址，需要允许双方不同网段协议的配合。

**（1）为接口配置无编号地址**

r1(config)#int s1/1

r1(config-if)#ipv6 unnumbered f0/0

**（2）查看接口IPv6地址情况。**

r1#show ipv6 interface brief serial 1/1

Serial1/1                  [up/up]

FE80::C200:EFF:FEB0:0

unnumbered (FastEthernet0/0)

r1#

**说明：**可以看到结果显示为接口S1/1借用F0/0的地址。